OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1194/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.096951425094066 0 -7.123043144486055)
	(16.645427137641096 0 -7.123043144486055)
	(16.645427137641096 8.060285663497378 -7.123043144486055)
	(-11.096951425094066 8.060285663497378 -7.123043144486055)
	(-11.096951425094066 0 2.811727557033969)
	(16.645427137641096 0 2.811727557033969)
	(16.645427137641096 8.060285663497378 2.811727557033969)
	(-11.096951425094066 8.060285663497378 2.811727557033969)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (148 43 53) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

