OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1194/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      turbulenceProperties;
}

simulationType RAS;

RAS
{
	RASModel        kOmegaSST;
	turbulence      on;
	printCoeffs     on;
	decayControl    yes;
	kInf            0.00011574111119032804;
	omegaInf        0.7960667248913427;
}

