OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1194/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      dynamicMeshDict;
}

dynamicFvMesh       dynamicMotionSolverFvMesh;
motionSolverLibs    ("libsixDoFRigidBodyMotion.so");
solver              sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
	patches                   (hull deck rudder);
	innerDistance             0.27586;
	outerDistance             2.7586;
	centreOfMass              (-0.239653375 0.000000000 -0.037930750);
	mass                      800.3957024383503;
	momentOfInertia           (75.276673545 2038.881503393 2097.002112606);
	rhoInf                    1;
	report                    on;
	reportToFile              on;
	value                     uniform (0 0 0);
	accelerationRelaxation    0.4;
	accelerationDamping       0.9;
	solver
	{
		type    Newmark;
	}
	constraints
	{
		zAxis
		{
			sixDoFRigidBodyMotionConstraint    line;
			direction                          (0 0 1);
		}
		yPlane
		{
			sixDoFRigidBodyMotionConstraint    axis;
			axis                               (0.000000 1.000000 0);
		}
	}
	restraints
	{
		translationDamper
		{
			sixDoFRigidBodyMotionRestraint    linearDamper;
			coeff                             44693.6234394476;
		}
		rotationDamper
		{
			sixDoFRigidBodyMotionRestraint    sphericalAngularDamper;
			coeff                             117095.35981643347;
		}
	}
}

