OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1194/0.org/include/initialConditions
flowVelocity          (0.878412 0 0);
Umean                  0.878412;
turbulentKE            1.157411e-04;
turbulentOmega         7.960667e-01;
turbulentEpsilon       3.525264e-04;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;