OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1194/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      fvSolution;
}

solvers
{
	"alpha.water.*"
	{
		nAlphaCorr            3;
		nAlphaSubCycles       1;
		cAlpha                1;
		icAlpha               0;
		MULESCorr             yes;
		nLimiterIter          10;
		alphaApplyPrevCorr    yes;
		solver                smoothSolver;
		smoother              symGaussSeidel;
		tolerance             1e-10;
		relTol                0;
		minIter               1;
	}
	"pcorr.*"
	{
		solver       GAMG;
		smoother     DIC;
		tolerance    0.001;
		relTol       0;
	}
	p_rgh
	{
		solver       GAMG;
		smoother     DIC;
		tolerance    1e-08;
		relTol       0.01;
	}
	p_rghFinal
	{
		$p_rgh;
		relTol    0.001;
	}
	"(U|k|omega)"
	{
		solver       smoothSolver;
		smoother     GaussSeidel;
		tolerance    1e-09;
		relTol       0.01;
		minIter      1;
	}
	"(U|k|omega)Final"
	{
		$U;
		relTol    0.001;
	}
	"cellDisplacement.*"
	{
		solver       GAMG;
		smoother     GaussSeidel;
		tolerance    1e-09;
		relTol       0;
	}
	yPsi
	{
		solver       GAMG;
		smoother     GaussSeidel;
		tolerance    1e-09;
		relTol       0.0;
	}
	yPsiFinal
	{
		$yPsi;
	}
}

PIMPLE
{
	momentumPredictor           yes;
	nOuterCorrectors            1;
	nCorrectors                 2;
	nNonOrthogonalCorrectors    0;
	correctPhi                          yes;
	moveMeshOuterCorrectors     yes;
	turbOnFinalIterOnly             yes;
	residualControl
	{
		p_rgh
		{
			tolerance    1e-05;
			relTol       0.0;
		}
		U
		{
			tolerance    1e-06;
			relTol       0.0;
		}
	}
}

relaxationFactors
{
	fields
	{
		p         1;
		pFinal    1;
	}
	equations
	{
		"(U|k|omega)"         1;
		"(U|k|omega)Final"    1;
	}
}

cache
{
	grad(U);
}

